{
    "format": "layers-model",
    "generatedBy": "keras v3.7.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
      "keras_version": "3.7.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Functional",
        "config": {
          "name": "functional_1",
          "trainable": true,
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_shape": [null, 10, 224, 224, 3],
                "dtype": "float32",
                "sparse": false,
                "name": "input_layer_1"
              },
              "name": "input_layer_1",
              "inbound_nodes": []
            },
            {
              "class_name": "ConvLSTM2D",
              "config": {
                "name": "conv_lstm2d_1",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "zero_output_for_mask": false,
                "filters": 32,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Orthogonal",
                  "config": {
                    "seed": null,
                    "gain": 1.0
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "seed": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 10, 224, 224, 3],
                        "dtype": "float32",
                        "keras_history": ["input_layer_1", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {
                    "training": false,
                    "mask": null
                  }
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_9",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 64,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 224, 224, 32],
                        "dtype": "float32",
                        "keras_history": ["conv_lstm2d_1", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_5",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 224, 224, 64],
                        "dtype": "float32",
                        "keras_history": ["conv2d_9", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {
                    "mask": null
                  }
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_10",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 64,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 224, 224, 64],
                        "dtype": "float32",
                        "keras_history": ["batch_normalization_5", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "MaxPooling2D",
              "config": {
                "name": "max_pooling2d_2",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "pool_size": [2, 2],
                "padding": "valid",
                "strides": [2, 2],
                "data_format": "channels_last"
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 224, 224, 64],
                        "dtype": "float32",
                        "keras_history": ["conv2d_10", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_11",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 128,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 112, 112, 64],
                        "dtype": "float32",
                        "keras_history": ["max_pooling2d_2", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_6",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 112, 112, 128],
                        "dtype": "float32",
                        "keras_history": ["conv2d_11", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {
                    "mask": null
                  }
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_12",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 128,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 112, 112, 128],
                        "dtype": "float32",
                        "keras_history": ["batch_normalization_6", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "MaxPooling2D",
              "config": {
                "name": "max_pooling2d_3",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "pool_size": [2, 2],
                "padding": "valid",
                "strides": [2, 2],
                "data_format": "channels_last"
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 112, 112, 128],
                        "dtype": "float32",
                        "keras_history": ["conv2d_12", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_13",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 256,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 56, 56, 128],
                        "dtype": "float32",
                        "keras_history": ["max_pooling2d_3", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_7",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 56, 56, 256],
                        "dtype": "float32",
                        "keras_history": ["conv2d_13", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {
                    "mask": null
                  }
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_14",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 256,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 56, 56, 256],
                        "dtype": "float32",
                        "keras_history": ["batch_normalization_7", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "Conv2DTranspose",
              "config": {
                "name": "conv2d_transpose_2",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 128,
                "kernel_size": [3, 3],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 56, 56, 256],
                        "dtype": "float32",
                        "keras_history": ["conv2d_14", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "Concatenate",
              "config": {
                "name": "concatenate_2",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "axis": -1
              },
              "inbound_nodes": [
                {
                  "args": [
                    [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [null, 112, 112, 128],
                          "dtype": "float32",
                          "keras_history": ["conv2d_transpose_2", 0, 0]
                        }
                      },
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [null, 112, 112, 128],
                          "dtype": "float32",
                          "keras_history": ["conv2d_12", 0, 0]
                        }
                      }
                    ]
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_15",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 128,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 112, 112, 256],
                        "dtype": "float32",
                        "keras_history": ["concatenate_2", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_8",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 112, 112, 128],
                        "dtype": "float32",
                        "keras_history": ["conv2d_15", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {
                    "mask": null
                  }
                }
              ]
            },
            {
              "class_name": "Conv2DTranspose",
              "config": {
                "name": "conv2d_transpose_3",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 64,
                "kernel_size": [3, 3],
                "strides": [2, 2],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 112, 112, 128],
                        "dtype": "float32",
                        "keras_history": ["batch_normalization_8", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "Concatenate",
              "config": {
                "name": "concatenate_3",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "axis": -1
              },
              "inbound_nodes": [
                {
                  "args": [
                    [
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [null, 224, 224, 64],
                          "dtype": "float32",
                          "keras_history": ["conv2d_transpose_3", 0, 0]
                        }
                      },
                      {
                        "class_name": "__keras_tensor__",
                        "config": {
                          "shape": [null, 224, 224, 64],
                          "dtype": "float32",
                          "keras_history": ["conv2d_10", 0, 0]
                        }
                      }
                    ]
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_16",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 64,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 224, 224, 128],
                        "dtype": "float32",
                        "keras_history": ["concatenate_3", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            },
            {
              "class_name": "BatchNormalization",
              "config": {
                "name": "batch_normalization_9",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "axis": -1,
                "momentum": 0.99,
                "epsilon": 0.001,
                "center": true,
                "scale": true,
                "beta_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "gamma_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "moving_mean_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "moving_variance_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Ones",
                  "config": {}
                },
                "beta_regularizer": null,
                "gamma_regularizer": null,
                "beta_constraint": null,
                "gamma_constraint": null,
                "synchronized": false
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 224, 224, 64],
                        "dtype": "float32",
                        "keras_history": ["conv2d_16", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {
                    "mask": null
                  }
                }
              ]
            },
            {
              "class_name": "Conv2D",
              "config": {
                "name": "conv2d_17",
                "trainable": true,
                "dtype": {
                  "module": "keras",
                  "class_name": "DTypePolicy",
                  "config": {
                    "name": "float32"
                  }
                },
                "filters": 3,
                "kernel_size": [1, 1],
                "strides": [1, 1],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [1, 1],
                "activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "inbound_nodes": [
                {
                  "args": [
                    {
                      "class_name": "__keras_tensor__",
                      "config": {
                        "shape": [null, 224, 224, 64],
                        "dtype": "float32",
                        "keras_history": ["batch_normalization_9", 0, 0]
                      }
                    }
                  ],
                  "kwargs": {}
                }
              ]
            }
          ],
          "input_layers": [["input_layer_1", 0, 0]],
          "output_layers": [["conv2d_17", 0, 0]]
        }
      },
      "training_config": {
        "loss": "mse",
        "loss_weights": null,
        "metrics": ["mae"],
        "weighted_metrics": null,
        "run_eagerly": false,
        "steps_per_execution": 1,
        "jit_compile": true,
        "optimizer_config": {
          "class_name": "RMSprop",
          "config": {
            "name": "rmsprop",
            "learning_rate": 0.001,
            "weight_decay": null,
            "clipnorm": null,
            "global_clipnorm": null,
            "clipvalue": null,
            "use_ema": false,
            "ema_momentum": 0.99,
            "ema_overwrite_frequency": null,
            "loss_scale_factor": null,
            "gradient_accumulation_steps": null,
            "rho": 0.9,
            "momentum": 0.0,
            "epsilon": 1e-07,
            "centered": false
          }
        }
      },
      "weightsManifest": [
        {
          "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"],
          "weights": [
            {"name": "batch_normalization_5/gamma", "shape": [64], "dtype": "float32"},
            {"name": "batch_normalization_5/beta", "shape": [64], "dtype": "float32"},
            {"name": "batch_normalization_5/moving_mean", "shape": [64], "dtype": "float32"},
            {"name": "batch_normalization_5/moving_variance", "shape": [64], "dtype": "float32"},
            {"name": "batch_normalization_6/gamma", "shape": [128], "dtype": "float32"},
            {"name": "batch_normalization_6/beta", "shape": [128], "dtype": "float32"},
            {"name": "batch_normalization_6/moving_mean", "shape": [128], "dtype": "float32"},
            {"name": "batch_normalization_6/moving_variance", "shape": [128], "dtype": "float32"},
            {"name": "batch_normalization_7/gamma", "shape": [256], "dtype": "float32"},
            {"name": "batch_normalization_7/beta", "shape": [256], "dtype": "float32"},
            {"name": "batch_normalization_7/moving_mean", "shape": [256], "dtype": "float32"},
            {"name": "batch_normalization_7/moving_variance", "shape": [256], "dtype": "float32"},
            {"name": "batch_normalization_8/gamma", "shape": [128], "dtype": "float32"},
            {"name": "batch_normalization_8/beta", "shape": [128], "dtype": "float32"},
            {"name": "batch_normalization_8/moving_mean", "shape": [128], "dtype": "float32"},
            {"name": "batch_normalization_8/moving_variance", "shape": [128], "dtype": "float32"},
            {"name": "batch_normalization_9/gamma", "shape": [64], "dtype": "float32"},
            {"name": "batch_normalization_9/beta", "shape": [64], "dtype": "float32"},
            {"name": "batch_normalization_9/moving_mean", "shape": [64], "dtype": "float32"},
            {"name": "batch_normalization_9/moving_variance", "shape": [64], "dtype": "float32"},
            {"name": "conv2d_10/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"},
            {"name": "conv2d_10/bias", "shape": [64], "dtype": "float32"},
            {"name": "conv2d_11/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"},
            {"name": "conv2d_11/bias", "shape": [128], "dtype": "float32"},
            {"name": "conv2d_12/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"},
            {"name": "conv2d_12/bias", "shape": [128], "dtype": "float32"},
            {"name": "conv2d_13/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"},
            {"name": "conv2d_13/bias", "shape": [256], "dtype": "float32"},
            {"name": "conv2d_14/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"},
            {"name": "conv2d_14/bias", "shape": [256], "dtype": "float32"},
            {"name": "conv2d_15/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"},
            {"name": "conv2d_15/bias", "shape": [128], "dtype": "float32"},
            {"name": "conv2d_16/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"},
            {"name": "conv2d_16/bias", "shape": [64], "dtype": "float32"},
            {"name": "conv2d_17/kernel", "shape": [1, 1, 64, 3], "dtype": "float32"},
            {"name": "conv2d_17/bias", "shape": [3], "dtype": "float32"},
            {"name": "conv2d_9/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"},
            {"name": "conv2d_9/bias", "shape": [64], "dtype": "float32"},
            {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"},
            {"name": "conv2d_transpose_2/bias", "shape": [128], "dtype": "float32"},
            {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"},
            {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"},
            {"name": "conv_lstm2d_1/conv_lstm_cell/kernel", "shape": [3, 3, 3, 128], "dtype": "float32"},
            {"name": "conv_lstm2d_1/conv_lstm_cell/recurrent_kernel", "shape": [3, 3, 32, 128], "dtype": "float32"},
            {"name": "conv_lstm2d_1/conv_lstm_cell/bias", "shape": [128], "dtype": "float32"}
          ]
        }
      ]
    }
  }
  